back/app/controllers/api/course_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    json_response(Course.find(params[:id]))