back/app/controllers/api/university_controller.rb

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    json_response(University.find(params[:id]))