back/app/controllers/api/university_offer_controller.rb

  def index
    offers = Offer.where(university_id: params["university_id"]).take(PAGE_SIZE)
---
SELECT  "offers".* FROM "offers" WHERE "offers"."university_id" = ? LIMIT ?  [["university_id", 1], ["LIMIT", 10]]